<!-- add-pr-comment:quicksight_plan -->

# staging/quicksight Terragrunt Plan:
```shell
Terraform will perform the following actions:
  # aws_cloudwatch_event_rule.step_function_daily_trigger will be created
  + resource "aws_cloudwatch_event_rule" "step_function_daily_trigger" {
      + arn                 = (known after apply)
      + description         = "Daily trigger to update Athena table locations"
      + event_bus_name      = "default"
      + force_destroy       = false
      + id                  = (known after apply)
      + name                = "daily-athena-update-table-location"
      + name_prefix         = (known after apply)
      + region              = "ca-central-1"
      + schedule_expression = "cron(10 5 * * ? *)"
      + tags_all            = (known after apply)
    }
  # aws_cloudwatch_event_target.target_with_role will be created
  + resource "aws_cloudwatch_event_target" "target_with_role" {
      + arn            = "arn:aws:states:ca-central-1:239043911459:stateMachine:AthenaUpdateTableLocation"
      + event_bus_name = "default"
      + force_destroy  = false
      + id             = (known after apply)
      + region         = "ca-central-1"
      + role_arn       = (known after apply)
      + rule           = "daily-athena-update-table-location"
      + target_id      = (known after apply)
    }
  # aws_iam_role.eventbridge_role will be created
  + resource "aws_iam_role" "eventbridge_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "events.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "eventbridge-invoke-sfn-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
      + inline_policy (known after apply)
    }
  # aws_iam_role_policy.eventbridge_sfn_invoke_policy will be created
  + resource "aws_iam_role_policy" "eventbridge_sfn_invoke_policy" {
      + id          = (known after apply)
      + name        = "EventBridgeInvokeSFNPolicy"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "states:StartExecution"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:states:ca-central-1:239043911459:stateMachine:AthenaUpdateTableLocation"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }
  # aws_quicksight_data_set.notifications_athena[0] will be updated in-place
  ~ resource "aws_quicksight_data_set" "notifications_athena" {
        id             = "239043911459,notifications_athena"
        name           = "Notifications_Athena"
        tags           = {}
        # (7 unchanged attributes hidden)
      - physical_table_map {
          - physical_table_map_id = "notifications-athena" -> null
          - relational_table {
              - data_source_arn = "arn:aws:quicksight:ca-central-1:239043911459:datasource/athena-quicksight-data-source" -> null
              - name            = "vw_notifications" -> null
              - schema          = "notification_quicksight" -> null
                # (1 unchanged attribute hidden)
              - input_columns {
                  - name = "notification_id" -> null
                  - type = "STRING" -> null
                }
              - input_columns {
                  - name = "notification_billable_units" -> null
                  - type = "INTEGER" -> null
                }
              - input_columns {
                  - name = "notification_created_at" -> null
                  - type = "DATETIME" -> null
                }
              - input_columns {
                  - name = "notification_sent_at" -> null
                  - type = "DATETIME" -> null
                }
              - input_columns {
                  - name = "notification_updated_at" -> null
                  - type = "DATETIME" -> null
                }
              - input_columns {
                  - name = "notification_queue_name" -> null
                  - type = "STRING" -> null
                }
              - input_columns {
                  - name = "notification_status" -> null
                  - type = "STRING" -> null
                }
              - input_columns {
                  - name = "notification_type" -> null
                  - type = "STRING" -> null
                }
              - input_columns {
                  - name = "notification_reference" -> null
                  - type = "STRING" -> null
                }
              - input_columns {
                  - name = "job_id" -> null
                  - type = "STRING" -> null
                }
              - input_columns {
                  - name = "api_key_id" -> null
                  - type = "STRING" -> null
                }
              - input_columns {
                  - name = "api_key_type" -> null
                  - type = "STRING" -> null
                }
              - input_columns {
                  - name = "service_id" -> null
                  - type = "STRING" -> null
                }
              - input_columns {
                  - name = "service_active" -> null
                  - type = "BOOLEAN" -> null
                }
              - input_columns {
                  - name = "service_restricted" -> null
                  - type = "BOOLEAN" -> null
                }
              - input_columns {
                  - name = "service_research_mode" -> null
                  - type = "BOOLEAN" -> null
                }
              - input_columns {
                  - name = "service_count_as_live" -> null
                  - type = "BOOLEAN" -> null
                }
              - input_columns {
                  - name = "service_go_live_at" -> null
                  - type = "DATETIME" -> null
                }
              - input_columns {
                  - name = "service_name" -> null
                  - type = "STRING" -> null
                }
              - input_columns {
                  - name = "service_message_limit" -> null
                  - type = "INTEGER" -> null
                }
              - input_columns {
                  - name = "service_rate_limit" -> null
                  - type = "INTEGER" -> null
                }
              - input_columns {
                  - name = "service_sms_daily_limit" -> null
                  - type = "INTEGER" -> null
                }
              - input_columns {
                  - name = "organisation_name" -> null
                  - type = "STRING" -> null
                }
              - input_columns {
                  - name = "organisation_id" -> null
                  - type = "STRING" -> null
                }
              - input_columns {
                  - name = "template_id" -> null
                  - type = "STRING" -> null
                }
              - input_columns {
                  - name = "template_created_at" -> null
                  - type = "DATETIME" -> null
                }
              - input_columns {
                  - name = "template_name" -> null
                  - type = "STRING" -> null
                }
              - input_columns {
                  - name = "template_updated_at" -> null
                  - type = "DATETIME" -> null
                }
              - input_columns {
                  - name = "template_version" -> null
                  - type = "INTEGER" -> null
                }
              - input_columns {
                  - name = "tc_id" -> null
                  - type = "STRING" -> null
                }
              - input_columns {
                  - name = "tc_name_en" -> null
                  - type = "STRING" -> null
                }
              - input_columns {
                  - name = "tc_name_fr" -> null
                  - type = "STRING" -> null
                }
              - input_columns {
                  - name = "tc_email_process_type" -> null
                  - type = "STRING" -> null
                }
              - input_columns {
                  - name = "tc_sms_process_type" -> null
                  - type = "STRING" -> null
                }
              - input_columns {
                  - name = "tc_sms_sending_vehicle" -> null
                  - type = "STRING" -> null
                }
              - input_columns {
                  - name = "sms_total_message_price" -> null
                  - type = "DECIMAL" -> null
                }
              - input_columns {
                  - name = "sms_total_carrier_fee" -> null
                  - type = "DECIMAL" -> null
                }
              - input_columns {
                  - name = "sms_iso_country_code" -> null
                  - type = "STRING" -> null
                }
              - input_columns {
                  - name = "sms_carrier_name" -> null
                  - type = "STRING" -> null
                }
              - input_columns {
                  - name = "sms_message_encoding" -> null
                  - type = "STRING" -> null
                }
              - input_columns {
                  - name = "sms_origination_phone_number" -> null
                  - type = "STRING" -> null
                }
            }
        }
      + physical_table_map {
          + physical_table_map_id = "notifications-athena"
          + relational_table {
              + data_source_arn = "arn:aws:quicksight:ca-central-1:239043911459:datasource/athena-quicksight-data-source"
              + name            = "vw_notification"
              + schema          = "notification_quicksight"
                # (1 unchanged attribute hidden)
              + input_columns {
                  + name = "notification_id"
                  + type = "STRING"
                }
              + input_columns {
                  + name = "notification_billable_units"
                  + type = "INTEGER"
                }
              + input_columns {
                  + name = "notification_created_at"
                  + type = "DATETIME"
                }
              + input_columns {
                  + name = "notification_sent_at"
                  + type = "DATETIME"
                }
              + input_columns {
                  + name = "notification_updated_at"
                  + type = "DATETIME"
                }
              + input_columns {
                  + name = "notification_queue_name"
                  + type = "STRING"
                }
              + input_columns {
                  + name = "notification_status"
                  + type = "STRING"
                }
              + input_columns {
                  + name = "notification_type"
                  + type = "STRING"
                }
              + input_columns {
                  + name = "notification_reference"
                  + type = "STRING"
                }
              + input_columns {
                  + name = "job_id"
                  + type = "STRING"
                }
              + input_columns {
                  + name = "api_key_id"
                  + type = "STRING"
                }
              + input_columns {
                  + name = "api_key_type"
                  + type = "STRING"
                }
              + input_columns {
                  + name = "service_id"
                  + type = "STRING"
                }
              + input_columns {
                  + name = "service_active"
                  + type = "BOOLEAN"
                }
              + input_columns {
                  + name = "service_restricted"
                  + type = "BOOLEAN"
                }
              + input_columns {
                  + name = "service_research_mode"
                  + type = "BOOLEAN"
                }
              + input_columns {
                  + name = "service_count_as_live"
                  + type = "BOOLEAN"
                }
              + input_columns {
                  + name = "service_go_live_at"
                  + type = "DATETIME"
                }
              + input_columns {
                  + name = "service_name"
                  + type = "STRING"
                }
              + input_columns {
                  + name = "service_message_limit"
                  + type = "INTEGER"
                }
              + input_columns {
                  + name = "service_rate_limit"
                  + type = "INTEGER"
                }
              + input_columns {
                  + name = "service_sms_daily_limit"
                  + type = "INTEGER"
                }
              + input_columns {
                  + name = "organisation_name"
                  + type = "STRING"
                }
              + input_columns {
                  + name = "organisation_id"
                  + type = "STRING"
                }
              + input_columns {
                  + name = "template_id"
                  + type = "STRING"
                }
              + input_columns {
                  + name = "template_created_at"
                  + type = "DATETIME"
                }
              + input_columns {
                  + name = "template_name"
                  + type = "STRING"
                }
              + input_columns {
                  + name = "template_updated_at"
                  + type = "DATETIME"
                }
              + input_columns {
                  + name = "template_version"
                  + type = "INTEGER"
                }
              + input_columns {
                  + name = "tc_id"
                  + type = "STRING"
                }
              + input_columns {
                  + name = "tc_name_en"
                  + type = "STRING"
                }
              + input_columns {
                  + name = "tc_name_fr"
                  + type = "STRING"
                }
              + input_columns {
                  + name = "tc_email_process_type"
                  + type = "STRING"
                }
              + input_columns {
                  + name = "tc_sms_process_type"
                  + type = "STRING"
                }
              + input_columns {
                  + name = "tc_sms_sending_vehicle"
                  + type = "STRING"
                }
              + input_columns {
                  + name = "sms_total_message_price"
                  + type = "DECIMAL"
                }
              + input_columns {
                  + name = "sms_total_carrier_fee"
                  + type = "DECIMAL"
                }
              + input_columns {
                  + name = "sms_iso_country_code"
                  + type = "STRING"
                }
              + input_columns {
                  + name = "sms_carrier_name"
                  + type = "STRING"
                }
              + input_columns {
                  + name = "sms_message_encoding"
                  + type = "STRING"
                }
              + input_columns {
                  + name = "sms_origination_phone_number"
                  + type = "STRING"
                }
            }
          + s3_source (known after apply)
        }
        # (4 unchanged blocks hidden)
    }
Plan: 4 to add, 1 to change, 0 to destroy.

# --- End of Plan 1 ---